In [129]:
import pandas as pd 

dict1 = {'Name' : ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'Marks' : [80, 90, 85, 75, 95, 80, 85, 70, 60, 100],
    'Gender' : ['Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Male']}

df = pd.DataFrame(dict1)
df

        Name  Marks  Gender
0  Anastasia     80  Female
1       Dima     90    Male
2  Katherine     85  Female
3      James     75    Male
4      Emily     95  Female
5    Michael     80    Male
6    Matthew     85    Male
7      Laura     70  Female
8      Kevin     60    Male
9      Jonas    100    Male

In [130]:
# 1 Display Top 3 Rows of the dataset
df.head(3)

        Name  Marks  Gender
0  Anastasia     80  Female
1       Dima     90    Male
2  Katherine     85  Female

In [131]:
# 2 Check last 3 Rows of the dataset
df.tail(3)

    Name  Marks  Gender
7  Laura     70  Female
8  Kevin     60    Male
9  Jonas    100    Male

In [132]:
# 3 Display the shape of the dataset 
# this shape method returns a tuple of rows and columns 
print(df.shape)
print("Number of rows: ", df.shape[0])
print("Number of columns: ", df.shape[1])

(10, 3)
Number of rows:  10
Number of columns:  3

In [133]:
# 4 Get information about Dataset like Total number rows, Total number of Columns, Datatypes of each Column and memory requirement
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   Gender  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [134]:
# 5 Check Null value of dataset
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [135]:
# 6 Get overall statistic about the dataframe
df.describe(include='all')

             Name      Marks Gender
count          10   10.00000     10
unique         10        NaN      2
top     Anastasia        NaN   Male
freq            1        NaN      6
mean          NaN   82.00000    NaN
std           NaN   11.83216    NaN
min           NaN   60.00000    NaN
25%           NaN   76.25000    NaN
50%           NaN   82.50000    NaN
75%           NaN   88.75000    NaN
max           NaN  100.00000    NaN

In [136]:
# 7 Find unique values in dataset
df['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [137]:
# 8 Find unique values in dataset 
df['Gender'].nunique()

2

In [138]:
# 9 Display count of unique values
df['Gender'].value_counts()

Gender
Male      6
Female    4
Name: count, dtype: int64

In [139]:
# 10 Find Total number of students having Marks between 90 to 100 (inclusive) using between method
df[df['Marks'].between(90, 100)]

    Name  Marks  Gender
1   Dima     90    Male
4  Emily     95  Female
9  Jonas    100    Male

In [140]:
df['Marks'] >= 90

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: Marks, dtype: bool

In [141]:
df[df['Marks'] >= 90]

    Name  Marks  Gender
1   Dima     90    Male
4  Emily     95  Female
9  Jonas    100    Male

In [142]:
(df['Marks'] >= 90) & (df['Marks'] <= 100)

0    False
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: Marks, dtype: bool

In [143]:
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)]

    Name  Marks  Gender
1   Dima     90    Male
4  Emily     95  Female
9  Jonas    100    Male

In [144]:
df[(df['Marks'] >= 60) & (df['Marks'] <= 80)]

        Name  Marks  Gender
0  Anastasia     80  Female
3      James     75    Male
5    Michael     80    Male
7      Laura     70  Female
8      Kevin     60    Male

In [145]:
# 11 find total score of 90 to 100 student
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)]['Marks'].sum()

285

In [146]:
# 12 find amount of student got from 90 to 100
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)]['Marks'].count()

3

In [147]:
sum(df['Marks'].between(90, 100))

3

In [148]:
# 13 find average mark
df['Marks'].mean()

82.0

In [149]:
# 14 Apply method
df['Marks'].apply(lambda x: x * 2)

0    160
1    180
2    170
3    150
4    190
5    160
6    170
7    140
8    120
9    200
Name: Marks, dtype: int64

In [150]:
def marks(x):
    return x / 2

df['Marks'].apply(marks)

0    40.0
1    45.0
2    42.5
3    37.5
4    47.5
5    40.0
6    42.5
7    35.0
8    30.0
9    50.0
Name: Marks, dtype: float64

In [151]:
df['Half_Marks'] = df['Marks'].apply(marks)

In [152]:
df

        Name  Marks  Gender  Half_Marks
0  Anastasia     80  Female        40.0
1       Dima     90    Male        45.0
2  Katherine     85  Female        42.5
3      James     75    Male        37.5
4      Emily     95  Female        47.5
5    Michael     80    Male        40.0
6    Matthew     85    Male        42.5
7      Laura     70  Female        35.0
8      Kevin     60    Male        30.0
9      Jonas    100    Male        50.0

In [153]:
df['Multiple by 2'] = df['Marks'].apply(lambda x : x * 2)
df

        Name  Marks  Gender  Half_Marks  Multiple by 2
0  Anastasia     80  Female        40.0            160
1       Dima     90    Male        45.0            180
2  Katherine     85  Female        42.5            170
3      James     75    Male        37.5            150
4      Emily     95  Female        47.5            190
5    Michael     80    Male        40.0            160
6    Matthew     85    Male        42.5            170
7      Laura     70  Female        35.0            140
8      Kevin     60    Male        30.0            120
9      Jonas    100    Male        50.0            200

In [154]:
# 15 Map
df['Gender'].map({'Male' : 1, 'Female' : 0})

0    0
1    1
2    0
3    1
4    0
5    1
6    1
7    0
8    1
9    1
Name: Gender, dtype: int64

In [155]:
df['Male_Female'] = df['Gender'].map({'Male' : 1, 'Female' : 0})
df

        Name  Marks  Gender  Half_Marks  Multiple by 2  Male_Female
0  Anastasia     80  Female        40.0            160            0
1       Dima     90    Male        45.0            180            1
2  Katherine     85  Female        42.5            170            0
3      James     75    Male        37.5            150            1
4      Emily     95  Female        47.5            190            0
5    Michael     80    Male        40.0            160            1
6    Matthew     85    Male        42.5            170            1
7      Laura     70  Female        35.0            140            0
8      Kevin     60    Male        30.0            120            1
9      Jonas    100    Male        50.0            200            1

In [156]:
# 16 Drop the columns
df.drop('Half_Marks', axis=1)

        Name  Marks  Gender  Multiple by 2  Male_Female
0  Anastasia     80  Female            160            0
1       Dima     90    Male            180            1
2  Katherine     85  Female            170            0
3      James     75    Male            150            1
4      Emily     95  Female            190            0
5    Michael     80    Male            160            1
6    Matthew     85    Male            170            1
7      Laura     70  Female            140            0
8      Kevin     60    Male            120            1
9      Jonas    100    Male            200            1

In [157]:
df.drop(['Half_Marks', 'Male_Female'], axis=1, inplace=True)
df

        Name  Marks  Gender  Multiple by 2
0  Anastasia     80  Female            160
1       Dima     90    Male            180
2  Katherine     85  Female            170
3      James     75    Male            150
4      Emily     95  Female            190
5    Michael     80    Male            160
6    Matthew     85    Male            170
7      Laura     70  Female            140
8      Kevin     60    Male            120
9      Jonas    100    Male            200

In [158]:
# 17 print name of the column
df.columns

Index(['Name', 'Marks', 'Gender', 'Multiple by 2'], dtype='object')

In [159]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [163]:
# 18 sort the dataframe as per the marks column
df.sort_values(by='Marks')
df.sort_values(by='Marks', ascending=False, inplace=True)
df

        Name  Marks  Gender  Multiple by 2
9      Jonas    100    Male            200
4      Emily     95  Female            190
1       Dima     90    Male            180
2  Katherine     85  Female            170
6    Matthew     85    Male            170
0  Anastasia     80  Female            160
5    Michael     80    Male            160
3      James     75    Male            150
7      Laura     70  Female            140
8      Kevin     60    Male            120

In [161]:
# 19 display name & marks of female students
df[df['Gender'] == 'Female'][['Name', 'Marks']]

        Name  Marks
0  Anastasia     80
2  Katherine     85
4      Emily     95
7      Laura     70

In [162]:
df[df['Gender'].isin(['Female'])][['Name', 'Marks']]

        Name  Marks
0  Anastasia     80
2  Katherine     85
4      Emily     95
7      Laura     70

In [164]:
# 14 Apply method
df['Marks'].apply(lambda x: x * 2)

9    200
4    190
1    180
2    170
6    170
0    160
5    160
3    150
7    140
8    120
Name: Marks, dtype: int64